# CLI
brew "asdf"
brew "bat"
brew "broot"
brew "btop"
brew "coreutils"
brew "elixir"
brew "fd"
brew "git"
brew "go-task"
brew "k9s"
brew "lsd"
brew "mas"
brew "neovim"
brew "qrencode"
brew "sops"
brew "terminal-notifier"
brew "tmux"
brew "trash-cli"
brew "wget"

brew "nvm"
brew "virtualenvwrapper"

# CLI + GUI
brew "wireguard-tools"

# Custom taps
cask "finestructure/hummingbird/hummingbird"

# GUI
cask "balenaetcher"
cask "bambu-studio"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "home-assistant"
cask "iterm2"
cask "karabiner-elements"
cask "kopiaui"
cask "maccy"
cask "obs"
cask "plex"
cask "postico"
cask "raspberry-pi-imager"
cask "slack"
cask "stats"
cask "spotify"
cask "telegram"
cask "unnaturalscrollwheels"
cask "vnc-viewer"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# AppStore
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147 # appstore for safari support
mas "Home Assistant", id: 1099568401
# mas "WiFiman", id: 1385561119 # ios apps unsupported: https://github.com/mas-cli/mas/issues/321
mas "Windows App", id: 1295203466 # Microsoft Remote Desktop
mas "Xcode", id: 497799835
