# https://github.com/Homebrew/homebrew-bundle

mas "Xcode", id: 497799835

brew "git"
brew "coreutils"
brew "emacs"
brew "neovim"
brew "node"
brew "elixir"
brew "btop"
brew "bat"
brew "tmux"
brew "broot"
brew "asdf"
brew "terminal-notifier"
brew "nvm"
brew "wget"
brew "qrencode"
brew "virtualenvwrapper"
brew "fd"
brew "lsd"
brew "bat"
brew "trash-cli"
brew "go-task"
brew "atuin"

brew "wireguard-tools"

tap "finestructure/Hummingbird"
brew "finestructure/hummingbird/hummingbird"

cask "bitwarden"
cask "docker"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "home-assistant"
cask "iterm2"
cask "karabiner-elements"
cask "slack"
cask "stats"
cask "spotify"
cask "telegram"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "zoom"
